---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailTypeDefaultJoinOption.Miter
enum: Autodesk.Revit.DB.Architecture.RailTypeDefaultJoinOption
source: html/580cccc7-8138-2dbd-38fe-c6b82a514997.htm
---
# Autodesk.Revit.DB.Architecture.RailTypeDefaultJoinOption.Miter

The rails will be joined by a miter connection.